{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "name": "lambda_1", "output_shape": [66, 200, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0007\u0000\u0000\u0000\u0006\u0000\u0000\u0000S\u0000\u0000\u0000s\u00ab\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000\u0019\\\u0002\u0000}\u0001\u0000}\u0002\u0000d\u0003\u0000}\u0003\u0000|\u0003\u0000d\u0004\u0000\u0017}\u0004\u0000|\u0002\u0000d\u0005\u0000\u0018d\u0006\u0000\u001a}\u0005\u0000d\u0005\u0000|\u0005\u0000\u0017}\u0006\u0000|\u0000\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000|\u0003\u0000|\u0004\u0000\u0085\u0002\u0000|\u0005\u0000|\u0006\u0000\u0085\u0002\u0000d\u0007\u0000d\u0007\u0000\u0085\u0002\u0000f\u0004\u0000\u0019}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u00018}\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0003\u0000|\u0000\u0000d\b\u0000d\t\u0000\u0083\u0001\u0001\u001d}\u0000\u0000|\u0000\u0000S)\n\u00fa~Crops height and width to dimensions (66, 200), then normalize values to\n            mean 0 and standard deviation 1.\n        \u00e9\u0001\u0000\u0000\u0000\u00e9\u0003\u0000\u0000\u0000\u00e9<\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000\u00e9\u0002\u0000\u0000\u0000N\u00da\bkeepdimsT)\u0004\u00da\u0001K\u00da\tint_shape\u00da\u0004mean\u00da\u0003std)\u0007\u00da\u0001x\u00da\u0001m\u00da\u0001n\u00da\u0001a\u00da\u0001b\u00da\u0001c\u00da\u0001d\u00a9\u0000r\u0014\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-1fc238ad88b4>\u00da\tnormalize.\u0000\u0000\u0000s\u0012\u0000\u0000\u0000\u0000\u0004\u001f\u0002\u0006\u0001\n\u0001\u000e\u0001\n\u0002.\u0001\u0019\u0001\u0019\u0002", null, null], "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "conv1", "activity_regularizer": null, "W_constraint": null, "nb_filter": 24, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "conv2", "activity_regularizer": null, "W_constraint": null, "nb_filter": 36, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "border_mode": "valid", "nb_col": 5, "dim_ordering": "tf", "nb_row": 5, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "conv3", "activity_regularizer": null, "W_constraint": null, "nb_filter": 48, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "border_mode": "valid", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "conv4", "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "border_mode": "valid", "nb_col": 3, "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "conv5", "activity_regularizer": null, "W_constraint": null, "nb_filter": 64, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 1164, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "hidden1", "input_dim": 1152, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 100, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "hidden2", "input_dim": 1164, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 50, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "hidden3", "input_dim": 100, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 10, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "hidden4", "input_dim": 50, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "bias": true, "output_dim": 1, "b_regularizer": null, "b_constraint": null, "activation": "tanh", "name": "output", "input_dim": 10, "activity_regularizer": null, "W_constraint": null}}]}